#conding=utf-8
#@time 2020/12/29 14:02
#@AUTHOR sx
'''
运算符：
1.算术运算符：+，-，*，/,//,%,**
2.关系运算符：>,>=,<,<=,==,!=
3.逻辑运算符：not,and ,or
4.赋值运算符：+=，-=,*=,/=,//=,%=,**=
5.成员运算符：in ,not in
'''
a=10
b=3
print(a/b,a//b,a%b,a**b)
print(not(1+2>7),8==8)
a+=b   #a=a+b
print(a,b)
t=(1,2,3,4)
print(5   not in t)
'''
类型 ：
1.数据类型：整型int(),浮点型float(),布尔型bool(),复数型complex()
2.字符串类型：str() 单引号，双引号，三引号
'''
print(complex(2,4))
x=1.79
x=int(x)
x=[]
x=bool(x)
print(x)
# y=int(input("请输入内容："))   #input语句输入的内容类型为字符，如果有使用其他类型必须强制转换
# print(type(y))

s='hello world'
s1="study python"
print(s,s1)
s2="""
     《白雪歌送武判官归京》【唐】岑参

　　北风卷地白草折,胡天八月即飞雪.

　　忽如一夜春风来,千树万树梨花开.

　　散入珠帘湿罗幕,狐裘不暖锦衾薄.

　　将军角弓不得控,都护铁衣冷犹著.

　　瀚海阑干百丈冰,愁云惨淡万里凝.

　　中军置酒饮归客,胡琴琵琶与羌笛.

　　纷纷暮雪下辕门,风掣红旗冻不翻.

　　轮台东门送君去,去时雪满天山路.

　　山回路转不见君,雪上空留马行

"""
print(s2)
s3='他说:"明天请我们吃饭！"'
print(s3)

#字符串单个元素的取值方法：
#字符串名[index]

print(s[6],s[-5])
print(s[10],s[-1])
#多个字符元素的取值方法：
#字符串[start:end:step]
print(s[6:11],s[-6::],s[-6:-2])
print(s[::-1])

s[::]
